import {Card, Interval} from './../interfaces/Interfaces';
export const TwoIntervals: Interval[] = [
    {
      intervalName: 'Новости',
      intervalStart: 2015,
      intervalEnd: 2022,
      intervalCards: 
      [
        {
          date: 2015,
          text: `13 сентября — частное солнечное затмение, 
          видимое в Южной Африке и части Антарктиды`
        },
        {
          date: 2016,
          text: `Телескоп «Хаббл» обнаружил самую удалённую 
          из всех обнаруженных галактик, получившую обозначение GN-z11`
        },
        {
          date: 2017,
          text: `Компания Tesla официально представила 
          первый в мире электрический грузовик Tesla Semi`
        },
        {
          date: 2018,
          text: `Россия возглавила Совет Безопасности ООН`
        },
        {
          date: 2019,
          text: `Состоялась церемония восшествия на престол императора Японии Нарухито`
        }
      ]
    },
    {
      intervalName: 'Нейросети',
      intervalStart: 2023,
      intervalEnd: 2030,
      intervalCards: 
      [
        {
          date: 2023,
          text: `Нейросети начинают набирать большую популярность, 
          выпущена модель GPT-4 от OpenAI`
        },
        {
          date: 2025,
          text: `Новая модель GPT-5 показала невероятные результаты в кодинге, 
          ответив использовавшему её джуниору "Ты здесь баг, я написал твой код"`
        },
        {
          date: 2027,
          text: `Во все новые процессоры начали устанавилвать нейроускоритель, 
          благодаря чему в каждом чайнике и холодильнике теперь есть крошечная LLM,
          которая определяет какой кипяток вкуснее и при какой температуре лучше
           сохранятся йогурты`
        },
        {
          date: 2028,
          text: `За людей теперь общаются языковые модели, считывающие эмоции и желания
          владельца по мимике и примитивным звукам, дети больш не учат языки, языковой барьер
          побежден полностью`
        },
        {
          date: 2029,
          text: `Все основные решения за человека принимает вживленный в мозг нейропомощник,
          включая потребность в еде, сне, испражнении. Теперь человеку не нужно думать самостоятельно`
        },
        {
          date: 2030,
          text: `GBLKEWOPRPG$IOJ)($#)(JFGIJ!@#JR)*(#$JFI)M*WJ#*@J)FJK@)JKEFJK@K($FKM(@#()FK@(#KFK@)(FK#@$)))`
        }
      ]
    }
  ];
export const SixIntervals: Interval[] = [
    {
      intervalName: 'Образование',
      intervalStart: 1950,
      intervalEnd: 1960,
      intervalCards: 
      [
        {
          date: 1950,
          text: `13 сентября — частное солнечное затмение, 
          видимое в Южной Африке и части Антарктиды`
        },
        {
          date: 1950,
          text: `Телескоп «Хаббл» обнаружил самую удалённую 
          из всех обнаруженных галактик, получившую обозначение GN-z11`
        },
        {
          date: 1950,
          text: `Компания Tesla официально представила 
          первый в мире электрический грузовик Tesla Semi`
        },
        {
          date: 1950,
          text: `Россия возглавила Совет Безопасности ООН`
        },
        {
          date: 1950,
          text: `Состоялась церемония восшествия на престол императора Японии Нарухито`
        }
      ]
    },
    {
      intervalName: 'Искусство',
      intervalStart: 1960,
      intervalEnd: 1970,
      intervalCards: 
      [
        {
          date: 1960,
          text: `13 сентября — частное солнечное затмение, 
          видимое в Южной Африке и части Антарктиды`
        },
        {
          date: 1960,
          text: `Телескоп «Хаббл» обнаружил самую удалённую 
          из всех обнаруженных галактик, получившую обозначение GN-z11`
        },
        {
          date: 1960,
          text: `Компания Tesla официально представила 
          первый в мире электрический грузовик Tesla Semi`
        },
        {
          date: 1960,
          text: `Россия возглавила Совет Безопасности ООН`
        },
        {
          date: 1960,
          text: `Состоялась церемония восшествия на престол императора Японии Нарухито`
        }
      ]
    },
    {
      intervalName: 'Спорт',
      intervalStart: 1970,
      intervalEnd: 1980,
      intervalCards: 
      [
        {
          date: 1970,
          text: `13 сентября — частное солнечное затмение, 
          видимое в Южной Африке и части Антарктиды`
        },
        {
          date: 1970,
          text: `Телескоп «Хаббл» обнаружил самую удалённую 
          из всех обнаруженных галактик, получившую обозначение GN-z11`
        },
        {
          date: 1970,
          text: `Компания Tesla официально представила 
          первый в мире электрический грузовик Tesla Semi`
        },
        {
          date: 1970,
          text: `Россия возглавила Совет Безопасности ООН`
        },
        {
          date: 1970,
          text: `Состоялась церемония восшествия на престол императора Японии Нарухито`
        }
      ]
    },
    {
      intervalName: 'Кино',
      intervalStart: 1980,
      intervalEnd: 1990,
      intervalCards: 
      [
        {
          date: 1980,
          text: `13 сентября — частное солнечное затмение, 
          видимое в Южной Африке и части Антарктиды`
        },
        {
          date: 1980,
          text: `Телескоп «Хаббл» обнаружил самую удалённую 
          из всех обнаруженных галактик, получившую обозначение GN-z11`
        },
        {
          date: 1980,
          text: `Компания Tesla официально представила 
          первый в мире электрический грузовик Tesla Semi`
        },
        {
          date: 1980,
          text: `Россия возглавила Совет Безопасности ООН`
        },
        {
          date: 1980,
          text: `Состоялась церемония восшествия на престол императора Японии Нарухито`
        }
      ]
    },
    {
      intervalName: 'Исследования',
      intervalStart: 1990,
      intervalEnd: 2000,
      intervalCards: 
      [
        {
          date: 1990,
          text: `Нейросети начинают набирать большую популярность, 
          выпущена модель GPT-4 от OpenAI`
        },
        {
          date: 1990,
          text: `Новая модель GPT-5 показала невероятные результаты в кодинге, 
          ответив использовавшему её джуниору "Ты здесь баг, я неписал твой код"`
        },
        {
          date: 1990,
          text: `Во все новые процессоры начали устанавилвать нейроускоритель, 
          благодаря чему в каждом чайнике и холодильнике теперь есть крошечная LLM,
          которая определяет какой кипяток вкуснее и при какой температуре лучше
           сохранятся йогурты`
        },
        {
          date: 1990,
          text: `За людей теперь общаются языковые модели, считывающие эмоции и желания
          владельца по мимике и примитивным звукам, дети больш не учат языки, языковой барьер
          побежден полностью`
        },
        {
          date: 1990,
          text: `Все основные решения за человека принимает вживленный в мозг нейропомощник,
          включая потребность в еде, сне, испражнении. Теперь человеку не нужно думать самостоятельно`
        },
        {
          date: 1990,
          text: `GBLKEWOPRPG$IOJ)($#)(JFGIJ!@#JR)*(#$JFI)M*WJ#*@J)FJK@)JKEFJK@K($FKM(@#()FK@(#KFK@)(FK#@$)))`
        }
      ]
    },
    {
      intervalName: 'Наука',
      intervalStart: 2000,
      intervalEnd:2030,
      intervalCards: 
      [
        {
          date: 2023,
          text: `Нейросети начинают набирать большую популярность, 
          выпущена модель GPT-4 от OpenAI`
        },
        {
          date: 2025,
          text: `Новая модель GPT-5 показала невероятные результаты в кодинге, 
          ответив использовавшему её джуниору "Ты здесь баг, я неписал твой код"`
        },
        {
          date: 2027,
          text: `Во все новые процессоры начали устанавилвать нейроускоритель, 
          благодаря чему в каждом чайнике и холодильнике теперь есть крошечная LLM,
          которая определяет какой кипяток вкуснее и при какой температуре лучше
           сохранятся йогурты`
        },
        {
          date: 2028,
          text: `За людей теперь общаются языковые модели, считывающие эмоции и желания
          владельца по мимике и примитивным звукам, дети больш не учат языки, языковой барьер
          побежден полностью`
        },
        {
          date: 2029,
          text: `Все основные решения за человека принимает вживленный в мозг нейропомощник,
          включая потребность в еде, сне, испражнении. Теперь человеку не нужно думать самостоятельно`
        },
        {
          date: 2030,
          text: `GBLKEWOPRPG$IOJ)($#)(JFGIJ!@#JR)*(#$JFI)M*WJ#*@J)FJK@)JKEFJK@K($FKM(@#()FK@(#KFK@)(FK#@$)))`
        }
      ]
    }
];
