import {Card, Interval} from './../interfaces/Interfaces';
export const TwoIntervals: Interval[] = [
    {
      intervalName: 'Эпоха отмены рабства',
      intervalStart: 1850,
      intervalEnd: 1870,
      intervalCards: 
      [
        {
          date: 1853,
          text: `Начало Крымской войны между Россией и коалицией в составе Османской, Британской, Французской империй и Сардинии`
        },
        {
          date: 1854,
          text: `Коммодор Мэттью Перри силой открывает японские порты для торговли с США`
        },
        {
          date: 1859,
          text: `Чарльз Дарвин публикует книгу «Происхождение видов», революция в науке`
        },
        {
          date: 1863,
          text: `В США отменено рабство после Гражданской войны (Прокламация об освобождении)`
        },
        {
          date: 1865,
          text: `Убийство президента США Авраама Линкольна в театре`
        }
      ]
    },
    {
      intervalName: 'Бурный прогресс',
      intervalStart: 1871,
      intervalEnd: 1890,
      intervalCards: 
      [
        {
          date: 1871,
          text: `Образование Германской империи после победы во Франко-прусской войне`
        },
        {
          date: 1876,
          text: `Александр Белл патентует первый практический телефон`
        },
        {
          date: 1879,
          text: `Томас Эдисон успешно испытал первую лампу накаливания`
        },
        {
          date: 1885,
          text: `В Германии Карл Бенц построил первый автомобиль с бензиновым двигателем`
        },
        {
          date: 1889,
          text: `В Париже открыта Эйфелева башня как вход на Всемирную выставку`
        }
      ]
    }
];
export const FourIntervals: Interval[] = [
    {
      intervalName: 'Эпоха отмены рабства',
      intervalStart: 1850,
      intervalEnd: 1870,
      intervalCards: 
      [
        {
          date: 1853,
          text: `Начало Крымской войны между Россией и коалицией в составе Османской, Британской, Французской империй и Сардинии`
        },
        {
          date: 1854,
          text: `Коммодор Мэттью Перри силой открывает японские порты для торговли с США`
        },
        {
          date: 1859,
          text: `Чарльз Дарвин публикует книгу «Происхождение видов», революция в науке`
        },
        {
          date: 1863,
          text: `В США отменено рабство после Гражданской войны (Прокламация об освобождении)`
        },
        {
          date: 1865,
          text: `Убийство президента США Авраама Линкольна в театре`
        }
      ]
    },
    {
      intervalName: 'Бурный прогресс',
      intervalStart: 1871,
      intervalEnd: 1890,
      intervalCards: 
      [
        {
          date: 1871,
          text: `Образование Германской империи после победы во Франко-прусской войне`
        },
        {
          date: 1876,
          text: `Александр Белл патентует первый практический телефон`
        },
        {
          date: 1879,
          text: `Томас Эдисон успешно испытал первую лампу накаливания`
        },
        {
          date: 1885,
          text: `В Германии Карл Бенц построил первый автомобиль с бензиновым двигателем`
        },
        {
          date: 1889,
          text: `В Париже открыта Эйфелева башня как вход на Всемирную выставку`
        }
      ]
    },
    {
      intervalName: 'На пороге потрясений',
      intervalStart: 1891,
      intervalEnd: 1910,
      intervalCards: 
      [
        {
          date: 1896,
          text: `Первые современные Олимпийские игры возрождены в Афинах`
        },
        {
          date: 1903,
          text: `Братья Райт совершили первый в мире управляемый полет на самолете`
        },
        {
          date: 1904,
          text: `Начало Русско-японской войны, закончившейся поражением России`
        },
        {
          date: 1905,
          text: `В России произошла первая революция, приведшая к созданию Государственной думы`
        },
        {
          date: 1908,
          text: `Генри Форд начал производство модели «T», сделав автомобиль массовым`
        }
      ]
    },
    {
      intervalName: 'Великая революция',
      intervalStart: 1911,
      intervalEnd: 1930,
      intervalCards: 
      [
        {
          date: 1914,
          text: `Убийство эрцгерцога Франца Фердинанда в Сараево стало поводом к началу Первой мировой войны`
        },
        {
          date: 1917,
          text: `Великая Октябрьская социалистическая революция в России`
        },
        {
          date: 1920,
          text: `Принятие 19-й поправки к Конституции США, давшей женщинам право голоса`
        },
        {
          date: 1922,
          text: `Образование Союза Советских Социалистических Республик (СССР)`
        },
        {
          date: 1929,
          text: `Биржевой крах на Уолл-стрит, положивший начало Великой депрессии`
        }
      ]
    }
];
export const SixIntervals: Interval[] = [
    {
      intervalName: 'Эпоха отмены рабства',
      intervalStart: 1850,
      intervalEnd: 1870,
      intervalCards: 
      [
        {
          date: 1853,
          text: `Начало Крымской войны между Россией и коалицией в составе Османской, Британской, Французской империй и Сардинии`
        },
        {
          date: 1854,
          text: `Коммодор Мэттью Перри силой открывает японские порты для торговли с США`
        },
        {
          date: 1859,
          text: `Чарльз Дарвин публикует книгу «Происхождение видов», революция в науке`
        },
        {
          date: 1863,
          text: `В США отменено рабство после Гражданской войны (Прокламация об освобождении)`
        },
        {
          date: 1865,
          text: `Убийство президента США Авраама Линкольна в театре`
        }
      ]
    },
    {
      intervalName: 'Бурный прогресс',
      intervalStart: 1871,
      intervalEnd: 1890,
      intervalCards: 
      [
        {
          date: 1871,
          text: `Образование Германской империи после победы во Франко-прусской войне`
        },
        {
          date: 1876,
          text: `Александр Белл патентует первый практический телефон`
        },
        {
          date: 1879,
          text: `Томас Эдисон успешно испытал первую лампу накаливания`
        },
        {
          date: 1885,
          text: `В Германии Карл Бенц построил первый автомобиль с бензиновым двигателем`
        },
        {
          date: 1889,
          text: `В Париже открыта Эйфелева башня как вход на Всемирную выставку`
        }
      ]
    },
    {
      intervalName: 'На пороге потрясений',
      intervalStart: 1891,
      intervalEnd: 1910,
      intervalCards: 
      [
        {
          date: 1896,
          text: `Первые современные Олимпийские игры возрождены в Афинах`
        },
        {
          date: 1903,
          text: `Братья Райт совершили первый в мире управляемый полет на самолете`
        },
        {
          date: 1904,
          text: `Начало Русско-японской войны, закончившейся поражением России`
        },
        {
          date: 1905,
          text: `В России произошла первая революция, приведшая к созданию Государственной думы`
        },
        {
          date: 1908,
          text: `Генри Форд начал производство модели «T», сделав автомобиль массовым`
        }
      ]
    },
    {
      intervalName: 'Великая революция',
      intervalStart: 1911,
      intervalEnd: 1930,
      intervalCards: 
      [
        {
          date: 1914,
          text: `Убийство эрцгерцога Франца Фердинанда в Сараево стало поводом к началу Первой мировой войны`
        },
        {
          date: 1917,
          text: `Великая Октябрьская социалистическая революция в России`
        },
        {
          date: 1920,
          text: `Принятие 19-й поправки к Конституции США, давшей женщинам право голоса`
        },
        {
          date: 1922,
          text: `Образование Союза Советских Социалистических Республик (СССР)`
        },
        {
          date: 1929,
          text: `Биржевой крах на Уолл-стрит, положивший начало Великой депрессии`
        }
      ]
    },
    {
      intervalName: 'Мировая война',
      intervalStart: 1933,
      intervalEnd: 1950,
      intervalCards: 
      [
        {
          date: 1933,
          text: `РКН РКН стал рейхсканцлером Германии`
        },
        {
          date: 1937,
          text: `Начало Второй японо-китайской войны, ставшей прологом к войне на Тихом океане`
        },
        {
          date: 1939,
          text: `Германия напала на Польшу, началась Вторая мировая война`
        },
        {
          date: 1945,
          text: `Сброс атомных бомб на Хиросиму и Нагасаки. Конец Второй мировой войны`
        },
        {
          date: 1947,
          text: `Индия получила независимость от Великобритании`
        },
        {
          date: 1949,
          text: `Образование NATO (НАТО) — военного союза западных стран`
        }
      ]
    },
    {
      intervalName: 'Что дальше ?',
      intervalStart: 2020,
      intervalEnd:2050,
      intervalCards: 
      [
        {
          date: 2021,
          text: `Частные компании (SpaceX, Blue Origin) начали регулярные туристические полеты в космос`
        },
        {
          date: 2029,
          text: `Принят первый международный «Акт о правах искусственного интеллекта»`
        },
        {
          date: 2033,
          text: `Запуск орбитальной фабрики по 3D-печати спутников и модулей для станций`
        },
        {
          date: 2037,
          text: `Объявлено о создании первого в мире квантового суперкомпьютера с практическим применением`
        },
        {
          date: 2047,
          text: `Цифровая копия сознания человека впервые выступила в суде в качестве свидетеля`
        },
        {
          date: 2050,
          text: `Человечество вплотную подошло к технологической сингулярности. Что дальше?`
        }
      ]
    }
];
